
void setup() {
   pinMode(8,OUTPUT); // пин 8 
   pinMode(9,OUTPUT); // пин 9 
   pinMode(10,OUTPUT); // пин 10 
   pinMode(11,OUTPUT); // пин 11 
   
   pinMode(A0,INPUT); // к аналоговому входу A0 
   pinMode(A1,INPUT); // к аналоговому входу A1 
   pinMode(A2,INPUT); // к аналоговому входу A2 
   pinMode(A3,INPUT); // к аналоговому входу A3 
}

void loop() {
   
   ///////////////////////////////////////////////////
   if(analogRead(A0)>150) {
      digitalWrite(8,true); // переключаем светодиод
      delay(20); // задержка
   }
   digitalWrite(8,false); // переключаем светодиод
   ///////////////////////////////////////////////////

   ///////////////////////////////////////////////////
   if(analogRead(A1)>150) {
      digitalWrite(9,true); // переключаем светодиод
      delay(20); // задержка
   }
   digitalWrite(9,false); // переключаем светодиод
   ///////////////////////////////////////////////////

   ///////////////////////////////////////////////////
   if(analogRead(A2)>150) {
      digitalWrite(10,true); // переключаем светодиод
      delay(20); // задержка
   }
   digitalWrite(10,false); // переключаем светодиод
   ///////////////////////////////////////////////////

   ///////////////////////////////////////////////////
   if(analogRead(A3)>150) {
      digitalWrite(11,true); // переключаем светодиод
      delay(20); // задержка
   }
   digitalWrite(11,false); // переключаем светодиод
   ///////////////////////////////////////////////////
   
}
